# Task11
# テーマ： Dictionaryの基本

"""
* 以下にあるのは、あるクラスの点数です。
1. 以下のDictionary から、Tom の点数だけを表示しなさい。
2. `for`ループを使って、一人ひとりの点数を表示しなさい。
3. `for`ループを使って、クラスの平均を出しなさい。
4. 以下のような結果が出るようにしなさい。
"""

"""
#### スタートコード (これはコピペしても良い)    *  **???** の箇所を自分のコードに置き換えること
my_class = {
  "Tom": 95,
  "Garnet": 76,
  "Jason": 69
 }

print("Tomの点数だけを出力")
print(???)

print("3人の点数を出力")
for ???:
    print(???)

print("3人の点数を文字列と共に出力")
for ??? in ???:
    print(??? + "'s score is " + str(???))



#### 出力
Tomの点数だけを出力
95
3人の点数を出力
95
76
69
3人の点数を文字列と共に出力
Tom's score is 99
Garnet's score is 76
Jason's score is 69
"""

# この下にコードを書く
